app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "fredo@fredo.com"], ["password_digest", "$2a$10$zb5WRuYiRvFx.RKYbfwRCuZ7b6chqyfIQAPEQto0qVOGPtGrD29Te"], ["created_at", 2017-02-20 11:26:16 UTC], ["updated_at", 2017-02-20 11:26:16 UTC]]

  def login
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fredo@fredo.com"], ["LIMIT", 1]]