app/controllers/favourites_controller.rb

  def index
    @favourites = Favourite.all
---
SELECT "favourites".* FROM "favourites"

  def create
    @favourite = Favourite.new(favourite_params)

    if @favourite.save
---
INSERT INTO "favourites" ("country", "city", "places_to_visit", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["country", "england"], ["city", "london"], ["places_to_visit", "tower of london"], ["user_id", 1], ["created_at", 2017-02-23 11:49:10 UTC], ["updated_at", 2017-02-23 11:49:10 UTC]]

    def set_favourite
      @favourite = Favourite.find(params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = $1  [["id", 1]]